---
kind: method
id: M:Autodesk.Revit.DB.KeyBasedTreeEntries.GetKeyBasedTreeEntriesIterator
source: html/29b5c59d-c99f-e4a4-76b8-9d6b00b1b6cd.htm
---
# Autodesk.Revit.DB.KeyBasedTreeEntries.GetKeyBasedTreeEntriesIterator Method

Returns a KeyBasedTreeEntriesIterator that iterates through the collection.

## Syntax (C#)
```csharp
public KeyBasedTreeEntriesIterator GetKeyBasedTreeEntriesIterator()
```

## Returns
A KeyBasedTreeEntriesIterator object that can be used to iterate through KeyBasedTreeEntry objects in the collection.